MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_CPU_INT_ISET Bits */
/* LFSS_CPU_INT_ISET[RTCRDY] Bits */
#define LFSS_CPU_INT_ISET_RTCRDY_OFS             (0)                             /* !< RTCRDY Offset */
#define LFSS_CPU_INT_ISET_RTCRDY_MASK            ((uint32_t)0x00000001U)         /* !< RTC ready */
#define LFSS_CPU_INT_ISET_RTCRDY_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_RTCRDY_SET             ((uint32_t)0x00000001U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[RTCTEV] Bits */
#define LFSS_CPU_INT_ISET_RTCTEV_OFS             (1)                             /* !< RTCTEV Offset */
#define LFSS_CPU_INT_ISET_RTCTEV_MASK            ((uint32_t)0x00000002U)         /* !< RTC time event */
#define LFSS_CPU_INT_ISET_RTCTEV_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_RTCTEV_SET             ((uint32_t)0x00000002U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[RTCA1] Bits */
#define LFSS_CPU_INT_ISET_RTCA1_OFS              (2)                             /* !< RTCA1 Offset */
#define LFSS_CPU_INT_ISET_RTCA1_MASK             ((uint32_t)0x00000004U)         /* !< RTC alarm 1 */
#define LFSS_CPU_INT_ISET_RTCA1_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_RTCA1_SET              ((uint32_t)0x00000004U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[RTCA2] Bits */
#define LFSS_CPU_INT_ISET_RTCA2_OFS              (3)                             /* !< RTCA2 Offset */
#define LFSS_CPU_INT_ISET_RTCA2_MASK             ((uint32_t)0x00000008U)         /* !< RTC alarm 2 */
#define LFSS_CPU_INT_ISET_RTCA2_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_RTCA2_SET              ((uint32_t)0x00000008U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[RT0PS] Bits */
#define LFSS_CPU_INT_ISET_RT0PS_OFS              (4)                             /* !< RT0PS Offset */
#define LFSS_CPU_INT_ISET_RT0PS_MASK             ((uint32_t)0x00000010U)         /* !< RTC prescale timer 0 */
#define LFSS_CPU_INT_ISET_RT0PS_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_RT0PS_SET              ((uint32_t)0x00000010U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[RT1PS] Bits */
#define LFSS_CPU_INT_ISET_RT1PS_OFS              (5)                             /* !< RT1PS Offset */
#define LFSS_CPU_INT_ISET_RT1PS_MASK             ((uint32_t)0x00000020U)         /* !< RTC prescale timer 1 */
#define LFSS_CPU_INT_ISET_RT1PS_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_RT1PS_SET              ((uint32_t)0x00000020U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[RT2PS] Bits */
#define LFSS_CPU_INT_ISET_RT2PS_OFS              (6)                             /* !< RT2PS Offset */
#define LFSS_CPU_INT_ISET_RT2PS_MASK             ((uint32_t)0x00000040U)         /* !< RTC prescale timer 2 */
#define LFSS_CPU_INT_ISET_RT2PS_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_RT2PS_SET              ((uint32_t)0x00000040U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TSEVT] Bits */
#define LFSS_CPU_INT_ISET_TSEVT_OFS              (7)                             /* !< TSEVT Offset */
#define LFSS_CPU_INT_ISET_TSEVT_MASK             ((uint32_t)0x00000080U)         /* !< Time stamp event */
#define LFSS_CPU_INT_ISET_TSEVT_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TSEVT_SET              ((uint32_t)0x00000080U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO0] Bits */
#define LFSS_CPU_INT_ISET_TIO0_OFS               (8)                             /* !< TIO0 Offset */
#define LFSS_CPU_INT_ISET_TIO0_MASK              ((uint32_t)0x00000100U)         /* !< Tamper I/O 0 event */
#define LFSS_CPU_INT_ISET_TIO0_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO0_SET               ((uint32_t)0x00000100U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO1] Bits */
#define LFSS_CPU_INT_ISET_TIO1_OFS               (9)                             /* !< TIO1 Offset */
#define LFSS_CPU_INT_ISET_TIO1_MASK              ((uint32_t)0x00000200U)         /* !< Tamper I/O 1 event */
#define LFSS_CPU_INT_ISET_TIO1_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO1_SET               ((uint32_t)0x00000200U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO2] Bits */
#define LFSS_CPU_INT_ISET_TIO2_OFS               (10)                            /* !< TIO2 Offset */
#define LFSS_CPU_INT_ISET_TIO2_MASK              ((uint32_t)0x00000400U)         /* !< Tamper I/O 2 event */
#define LFSS_CPU_INT_ISET_TIO2_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO2_SET               ((uint32_t)0x00000400U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO3] Bits */
#define LFSS_CPU_INT_ISET_TIO3_OFS               (11)                            /* !< TIO3 Offset */
#define LFSS_CPU_INT_ISET_TIO3_MASK              ((uint32_t)0x00000800U)         /* !< Tamper I/O 3 event */
#define LFSS_CPU_INT_ISET_TIO3_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO3_SET               ((uint32_t)0x00000800U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO4] Bits */
#define LFSS_CPU_INT_ISET_TIO4_OFS               (12)                            /* !< TIO4 Offset */
#define LFSS_CPU_INT_ISET_TIO4_MASK              ((uint32_t)0x00001000U)         /* !< Tamper I/O 4 event */
#define LFSS_CPU_INT_ISET_TIO4_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO4_SET               ((uint32_t)0x00001000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO5] Bits */
#define LFSS_CPU_INT_ISET_TIO5_OFS               (13)                            /* !< TIO5 Offset */
#define LFSS_CPU_INT_ISET_TIO5_MASK              ((uint32_t)0x00002000U)         /* !< Tamper I/O 5 event */
#define LFSS_CPU_INT_ISET_TIO5_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO5_SET               ((uint32_t)0x00002000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO6] Bits */
#define LFSS_CPU_INT_ISET_TIO6_OFS               (14)                            /* !< TIO6 Offset */
#define LFSS_CPU_INT_ISET_TIO6_MASK              ((uint32_t)0x00004000U)         /* !< Tamper I/O 6 event */
#define LFSS_CPU_INT_ISET_TIO6_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO6_SET               ((uint32_t)0x00004000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO7] Bits */
#define LFSS_CPU_INT_ISET_TIO7_OFS               (15)                            /* !< TIO7 Offset */
#define LFSS_CPU_INT_ISET_TIO7_MASK              ((uint32_t)0x00008000U)         /* !< Tamper I/O 7 event */
#define LFSS_CPU_INT_ISET_TIO7_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO7_SET               ((uint32_t)0x00008000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO8] Bits */
#define LFSS_CPU_INT_ISET_TIO8_OFS               (16)                            /* !< TIO8 Offset */
#define LFSS_CPU_INT_ISET_TIO8_MASK              ((uint32_t)0x00010000U)         /* !< Tamper I/O 8 event */
#define LFSS_CPU_INT_ISET_TIO8_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO8_SET               ((uint32_t)0x00010000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO9] Bits */
#define LFSS_CPU_INT_ISET_TIO9_OFS               (17)                            /* !< TIO9 Offset */
#define LFSS_CPU_INT_ISET_TIO9_MASK              ((uint32_t)0x00020000U)         /* !< Tamper I/O 9 event */
#define LFSS_CPU_INT_ISET_TIO9_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO9_SET               ((uint32_t)0x00020000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO10] Bits */
#define LFSS_CPU_INT_ISET_TIO10_OFS              (18)                            /* !< TIO10 Offset */
#define LFSS_CPU_INT_ISET_TIO10_MASK             ((uint32_t)0x00040000U)         /* !< Tamper I/O 10 event */
#define LFSS_CPU_INT_ISET_TIO10_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO10_SET              ((uint32_t)0x00040000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO11] Bits */
#define LFSS_CPU_INT_ISET_TIO11_OFS              (19)                            /* !< TIO11 Offset */
#define LFSS_CPU_INT_ISET_TIO11_MASK             ((uint32_t)0x00080000U)         /* !< Tamper I/O 11 event */
#define LFSS_CPU_INT_ISET_TIO11_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO11_SET              ((uint32_t)0x00080000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO12] Bits */
#define LFSS_CPU_INT_ISET_TIO12_OFS              (20)                            /* !< TIO12 Offset */
#define LFSS_CPU_INT_ISET_TIO12_MASK             ((uint32_t)0x00100000U)         /* !< Tamper I/O 12 event */
#define LFSS_CPU_INT_ISET_TIO12_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO12_SET              ((uint32_t)0x00100000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO13] Bits */
#define LFSS_CPU_INT_ISET_TIO13_OFS              (21)                            /* !< TIO13 Offset */
#define LFSS_CPU_INT_ISET_TIO13_MASK             ((uint32_t)0x00200000U)         /* !< Tamper I/O 13 event */
#define LFSS_CPU_INT_ISET_TIO13_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO13_SET              ((uint32_t)0x00200000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO14] Bits */
#define LFSS_CPU_INT_ISET_TIO14_OFS              (22)                            /* !< TIO14 Offset */
#define LFSS_CPU_INT_ISET_TIO14_MASK             ((uint32_t)0x00400000U)         /* !< Tamper I/O 14 event */
#define LFSS_CPU_INT_ISET_TIO14_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO14_SET              ((uint32_t)0x00400000U)         /* !< Set interrupt */
/* LFSS_CPU_INT_ISET[TIO15] Bits */
#define LFSS_CPU_INT_ISET_TIO15_OFS              (23)                            /* !< TIO15 Offset */
#define LFSS_CPU_INT_ISET_TIO15_MASK             ((uint32_t)0x00800000U)         /* !< Tamper I/O 15 event */
#define LFSS_CPU_INT_ISET_TIO15_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ISET_TIO15_SET              ((uint32_t)0x00800000U)         /* !< Set interrupt */

/* LFSS_CPU_INT_ICLR Bits */
/* LFSS_CPU_INT_ICLR[RTCRDY] Bits */
#define LFSS_CPU_INT_ICLR_RTCRDY_OFS             (0)                             /* !< RTCRDY Offset */
#define LFSS_CPU_INT_ICLR_RTCRDY_MASK            ((uint32_t)0x00000001U)         /* !< RTC ready */
#define LFSS_CPU_INT_ICLR_RTCRDY_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_RTCRDY_CLR             ((uint32_t)0x00000001U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[RTCTEV] Bits */
#define LFSS_CPU_INT_ICLR_RTCTEV_OFS             (1)                             /* !< RTCTEV Offset */
#define LFSS_CPU_INT_ICLR_RTCTEV_MASK            ((uint32_t)0x00000002U)         /* !< RTC time event */
#define LFSS_CPU_INT_ICLR_RTCTEV_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_RTCTEV_CLR             ((uint32_t)0x00000002U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[RTCA1] Bits */
#define LFSS_CPU_INT_ICLR_RTCA1_OFS              (2)                             /* !< RTCA1 Offset */
#define LFSS_CPU_INT_ICLR_RTCA1_MASK             ((uint32_t)0x00000004U)         /* !< RTC alarm 1 */
#define LFSS_CPU_INT_ICLR_RTCA1_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_RTCA1_CLR              ((uint32_t)0x00000004U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[RTCA2] Bits */
#define LFSS_CPU_INT_ICLR_RTCA2_OFS              (3)                             /* !< RTCA2 Offset */
#define LFSS_CPU_INT_ICLR_RTCA2_MASK             ((uint32_t)0x00000008U)         /* !< RTC alarm 2 */
#define LFSS_CPU_INT_ICLR_RTCA2_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_RTCA2_CLR              ((uint32_t)0x00000008U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[RT0PS] Bits */
#define LFSS_CPU_INT_ICLR_RT0PS_OFS              (4)                             /* !< RT0PS Offset */
#define LFSS_CPU_INT_ICLR_RT0PS_MASK             ((uint32_t)0x00000010U)         /* !< RTC prescale timer 0 */
#define LFSS_CPU_INT_ICLR_RT0PS_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_RT0PS_CLR              ((uint32_t)0x00000010U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[RT1PS] Bits */
#define LFSS_CPU_INT_ICLR_RT1PS_OFS              (5)                             /* !< RT1PS Offset */
#define LFSS_CPU_INT_ICLR_RT1PS_MASK             ((uint32_t)0x00000020U)         /* !< RTC prescale timer 1 */
#define LFSS_CPU_INT_ICLR_RT1PS_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_RT1PS_CLR              ((uint32_t)0x00000020U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[RT2PS] Bits */
#define LFSS_CPU_INT_ICLR_RT2PS_OFS              (6)                             /* !< RT2PS Offset */
#define LFSS_CPU_INT_ICLR_RT2PS_MASK             ((uint32_t)0x00000040U)         /* !< RTC prescale timer 2 */
#define LFSS_CPU_INT_ICLR_RT2PS_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_RT2PS_CLR              ((uint32_t)0x00000040U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TSEVT] Bits */
#define LFSS_CPU_INT_ICLR_TSEVT_OFS              (7)                             /* !< TSEVT Offset */
#define LFSS_CPU_INT_ICLR_TSEVT_MASK             ((uint32_t)0x00000080U)         /* !< Time stamp event */
#define LFSS_CPU_INT_ICLR_TSEVT_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TSEVT_CLR              ((uint32_t)0x00000080U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO0] Bits */
#define LFSS_CPU_INT_ICLR_TIO0_OFS               (8)                             /* !< TIO0 Offset */
#define LFSS_CPU_INT_ICLR_TIO0_MASK              ((uint32_t)0x00000100U)         /* !< Tamper I/O 0 event */
#define LFSS_CPU_INT_ICLR_TIO0_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO0_CLR               ((uint32_t)0x00000100U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO1] Bits */
#define LFSS_CPU_INT_ICLR_TIO1_OFS               (9)                             /* !< TIO1 Offset */
#define LFSS_CPU_INT_ICLR_TIO1_MASK              ((uint32_t)0x00000200U)         /* !< Tamper I/O 1 event */
#define LFSS_CPU_INT_ICLR_TIO1_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO1_CLR               ((uint32_t)0x00000200U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO2] Bits */
#define LFSS_CPU_INT_ICLR_TIO2_OFS               (10)                            /* !< TIO2 Offset */
#define LFSS_CPU_INT_ICLR_TIO2_MASK              ((uint32_t)0x00000400U)         /* !< Tamper I/O 2 event */
#define LFSS_CPU_INT_ICLR_TIO2_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO2_CLR               ((uint32_t)0x00000400U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO3] Bits */
#define LFSS_CPU_INT_ICLR_TIO3_OFS               (11)                            /* !< TIO3 Offset */
#define LFSS_CPU_INT_ICLR_TIO3_MASK              ((uint32_t)0x00000800U)         /* !< Tamper I/O 3 event */
#define LFSS_CPU_INT_ICLR_TIO3_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO3_CLR               ((uint32_t)0x00000800U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO4] Bits */
#define LFSS_CPU_INT_ICLR_TIO4_OFS               (12)                            /* !< TIO4 Offset */
#define LFSS_CPU_INT_ICLR_TIO4_MASK              ((uint32_t)0x00001000U)         /* !< Tamper I/O 4 event */
#define LFSS_CPU_INT_ICLR_TIO4_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO4_CLR               ((uint32_t)0x00001000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO5] Bits */
#define LFSS_CPU_INT_ICLR_TIO5_OFS               (13)                            /* !< TIO5 Offset */
#define LFSS_CPU_INT_ICLR_TIO5_MASK              ((uint32_t)0x00002000U)         /* !< Tamper I/O 5 event */
#define LFSS_CPU_INT_ICLR_TIO5_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO5_CLR               ((uint32_t)0x00002000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO6] Bits */
#define LFSS_CPU_INT_ICLR_TIO6_OFS               (14)                            /* !< TIO6 Offset */
#define LFSS_CPU_INT_ICLR_TIO6_MASK              ((uint32_t)0x00004000U)         /* !< Tamper I/O 6 event */
#define LFSS_CPU_INT_ICLR_TIO6_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO6_CLR               ((uint32_t)0x00004000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO7] Bits */
#define LFSS_CPU_INT_ICLR_TIO7_OFS               (15)                            /* !< TIO7 Offset */
#define LFSS_CPU_INT_ICLR_TIO7_MASK              ((uint32_t)0x00008000U)         /* !< Tamper I/O 7 event */
#define LFSS_CPU_INT_ICLR_TIO7_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO7_CLR               ((uint32_t)0x00008000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO8] Bits */
#define LFSS_CPU_INT_ICLR_TIO8_OFS               (16)                            /* !< TIO8 Offset */
#define LFSS_CPU_INT_ICLR_TIO8_MASK              ((uint32_t)0x00010000U)         /* !< Tamper I/O 8 event */
#define LFSS_CPU_INT_ICLR_TIO8_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO8_CLR               ((uint32_t)0x00010000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO9] Bits */
#define LFSS_CPU_INT_ICLR_TIO9_OFS               (17)                            /* !< TIO9 Offset */
#define LFSS_CPU_INT_ICLR_TIO9_MASK              ((uint32_t)0x00020000U)         /* !< Tamper I/O 9 event */
#define LFSS_CPU_INT_ICLR_TIO9_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO9_CLR               ((uint32_t)0x00020000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO10] Bits */
#define LFSS_CPU_INT_ICLR_TIO10_OFS              (18)                            /* !< TIO10 Offset */
#define LFSS_CPU_INT_ICLR_TIO10_MASK             ((uint32_t)0x00040000U)         /* !< Tamper I/O 10 event */
#define LFSS_CPU_INT_ICLR_TIO10_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO10_CLR              ((uint32_t)0x00040000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO11] Bits */
#define LFSS_CPU_INT_ICLR_TIO11_OFS              (19)                            /* !< TIO11 Offset */
#define LFSS_CPU_INT_ICLR_TIO11_MASK             ((uint32_t)0x00080000U)         /* !< Tamper I/O 11 event */
#define LFSS_CPU_INT_ICLR_TIO11_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO11_CLR              ((uint32_t)0x00080000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO12] Bits */
#define LFSS_CPU_INT_ICLR_TIO12_OFS              (20)                            /* !< TIO12 Offset */
#define LFSS_CPU_INT_ICLR_TIO12_MASK             ((uint32_t)0x00100000U)         /* !< Tamper I/O 12 event */
#define LFSS_CPU_INT_ICLR_TIO12_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO12_CLR              ((uint32_t)0x00100000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO13] Bits */
#define LFSS_CPU_INT_ICLR_TIO13_OFS              (21)                            /* !< TIO13 Offset */
#define LFSS_CPU_INT_ICLR_TIO13_MASK             ((uint32_t)0x00200000U)         /* !< Tamper I/O 13 event */
#define LFSS_CPU_INT_ICLR_TIO13_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO13_CLR              ((uint32_t)0x00200000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO14] Bits */
#define LFSS_CPU_INT_ICLR_TIO14_OFS              (22)                            /* !< TIO14 Offset */
#define LFSS_CPU_INT_ICLR_TIO14_MASK             ((uint32_t)0x00400000U)         /* !< Tamper I/O 14 event */
#define LFSS_CPU_INT_ICLR_TIO14_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO14_CLR              ((uint32_t)0x00400000U)         /* !< Clear interrupt */
/* LFSS_CPU_INT_ICLR[TIO15] Bits */
#define LFSS_CPU_INT_ICLR_TIO15_OFS              (23)                            /* !< TIO15 Offset */
#define LFSS_CPU_INT_ICLR_TIO15_MASK             ((uint32_t)0x00800000U)         /* !< Tamper I/O 15 event */
#define LFSS_CPU_INT_ICLR_TIO15_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_CPU_INT_ICLR_TIO15_CLR              ((uint32_t)0x00800000U)         /* !< Clear interrupt */

