MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_FSUB_0 Bits */
/* LFSS_FSUB_0[CHANID] Bits */
#define LFSS_FSUB_0_CHANID_OFS                   (0)                             /* !< CHANID Offset */
#define LFSS_FSUB_0_CHANID_MASK                  ((uint32_t)0x000000FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define LFSS_FSUB_0_CHANID_MNIMUM                ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define LFSS_FSUB_0_CHANID_UNCONNECTED           ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define LFSS_FSUB_0_CHANID_MAXIMUM               ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* LFSS_FPUB_0 Bits */
/* LFSS_FPUB_0[CHANID] Bits */
#define LFSS_FPUB_0_CHANID_OFS                   (0)                             /* !< CHANID Offset */
#define LFSS_FPUB_0_CHANID_MASK                  ((uint32_t)0x000000FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define LFSS_FPUB_0_CHANID_MNIMUM                ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define LFSS_FPUB_0_CHANID_UNCONNECTED           ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define LFSS_FPUB_0_CHANID_MAXIMUM               ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* LFSS_CLKSEL Bits */
/* LFSS_CLKSEL[LFCLK_SEL] Bits */
#define LFSS_CLKSEL_LFCLK_SEL_OFS                (1)                             /* !< LFCLK_SEL Offset */
#define LFSS_CLKSEL_LFCLK_SEL_MASK               ((uint32_t)0x00000002U)         /* !< Selects LFCLK as clock source if
                                                                                    enabled */
#define LFSS_CLKSEL_LFCLK_SEL_DISABLE            ((uint32_t)0x00000000U)         /* !< LFCLK is disabled */
#define LFSS_CLKSEL_LFCLK_SEL_ENABLE             ((uint32_t)0x00000002U)         /* !< LFCLK is enabled */

/* LFSS_EVT_MODE Bits */
/* LFSS_EVT_MODE[EVT0_CFG] Bits */
#define LFSS_EVT_MODE_EVT0_CFG_OFS               (0)                             /* !< EVT0_CFG Offset */
#define LFSS_EVT_MODE_EVT0_CFG_MASK              ((uint32_t)0x00000003U)         /* !< Event line mode 0 select */
#define LFSS_EVT_MODE_EVT0_CFG_SOFTWARE          ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. The software ISR
                                                                                    clears the associated RIS flag. */
/* LFSS_EVT_MODE[EVT1_CFG] Bits */
#define LFSS_EVT_MODE_EVT1_CFG_OFS               (2)                             /* !< EVT1_CFG Offset */
#define LFSS_EVT_MODE_EVT1_CFG_MASK              ((uint32_t)0x0000000CU)         /* !< Event line mode 1 select */
#define LFSS_EVT_MODE_EVT1_CFG_HARDWARE          ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* LFSS_DESC Bits */
/* LFSS_DESC[MINREV] Bits */
#define LFSS_DESC_MINREV_OFS                     (0)                             /* !< MINREV Offset */
#define LFSS_DESC_MINREV_MASK                    ((uint32_t)0x0000000FU)         /* !< Minor revision. This number holds
                                                                                    the module revision and is
                                                                                    incremented by the module developers.
                                                                                    n = Minor module revision (see
                                                                                    device-specific data sheet) */
#define LFSS_DESC_MINREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_DESC_MINREV_MAXIMUM                 ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* LFSS_DESC[MAJREV] Bits */
#define LFSS_DESC_MAJREV_OFS                     (4)                             /* !< MAJREV Offset */
#define LFSS_DESC_MAJREV_MASK                    ((uint32_t)0x000000F0U)         /* !< Major revision. This number holds
                                                                                    the module revision and is
                                                                                    incremented by the module developers.
                                                                                    n = Major version (see
                                                                                    device-specific data sheet) */
#define LFSS_DESC_MAJREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_DESC_MAJREV_MAXIMUM                 ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* LFSS_DESC[INSTNUM] Bits */
#define LFSS_DESC_INSTNUM_OFS                    (8)                             /* !< INSTNUM Offset */
#define LFSS_DESC_INSTNUM_MASK                   ((uint32_t)0x00000F00U)         /* !< Instantiated version. Describes
                                                                                    which instance of the module
                                                                                    accessed. */
#define LFSS_DESC_INSTNUM_INST0                  ((uint32_t)0x00000000U)         /* !< This is the default, if there is
                                                                                    only one instance - like for SSIM */
/* LFSS_DESC[FEATUREVER] Bits */
#define LFSS_DESC_FEATUREVER_OFS                 (12)                            /* !< FEATUREVER Offset */
#define LFSS_DESC_FEATUREVER_MASK                ((uint32_t)0x0000F000U)         /* !< Feature set of this module.
                                                                                    Differentiates the complexity of the
                                                                                    actually instantiated module if there
                                                                                    are differences. */
#define LFSS_DESC_FEATUREVER_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_DESC_FEATUREVER_MAXIMUM             ((uint32_t)0x0000F000U)         /* !< Highest possible value */
/* LFSS_DESC[MODULEID] Bits */
#define LFSS_DESC_MODULEID_OFS                   (16)                            /* !< MODULEID Offset */
#define LFSS_DESC_MODULEID_MASK                  ((uint32_t)0xFFFF0000U)         /* !< Module identifier. This ID is
                                                                                    unique for each module. 0x2911 =
                                                                                    Module ID of the LFSS Module */
#define LFSS_DESC_MODULEID_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_DESC_MODULEID_MAXIMUM               ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_lfss__include */